# Leçon SQL 2: Requêtes avec contraintes (Pt.1)

Nous savons maintenant comment sélectionner des colonnes de données spécifiques à partir d'une table, mais si vous aviez une table avec cent millions de lignes de données, lire toutes les lignes serait inefficace et peut-être même impossible.

Afin de filtrer certains résultats à partir du retour, nous devons utiliser une **WHERE** clause dans la requête. La clause est appliquée à chaque ligne de données en vérifiant les valeurs de colonne spécifiques pour déterminer si elle doit être incluse dans les résultats ou non.

Sélectionnez une requête avec des contraintes

``` mysql 
SELECT column, another_column, …
FROM mytable
WHERE condition
    AND/OR another_condition
    AND/OR …;
```

Des clauses plus complexes peuvent être construites en joignant de nombreux mots-clés logiques **AND** ou **OR** (c'est-à-dire num \ _wheels> = 4 AND portes <= 2). Et ci-dessous sont quelques opérateurs utiles que vous pouvez utiliser pour les données numériques (c'est-à-dire entier ou virgule flottante):

In [26]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

from pandasql import sqldf

In [27]:
x="""Opérateur	État	Exemple SQL
=,! =, <<=,>,> =	Opérateurs numériques standard	nom_col ! = 4
ENTRE ET …	Le nombre est compris dans la plage de deux valeurs (inclus)	col_name ENTRE 1.5 ET 10.5
PAS ENTRE… ET…	Le nombre ne se trouve pas dans la plage de deux valeurs (inclus)	col_name PAS ENTRE 1 ET 10
DANS (…)	Le numéro existe dans une liste	col_name IN (2, 4, 6)
PAS DEDANS (…)	Le numéro n'existe pas dans une liste	col_name NOT IN (1, 3, 5)"""
operateurs = to_df(x)

In [28]:
operateurs

,Opérateur,État,Exemple SQL
0,"=,! =, <<=,>,> =",Opérateurs numériques standard,nom_col ! = 4
1,ENTRE ET …,Le nombre est compris dans la plage de deux va...,col_name ENTRE 1.5 ET 10.5
2,PAS ENTRE… ET…,Le nombre ne se trouve pas dans la plage de de...,col_name PAS ENTRE 1 ET 10
3,DANS (…),Le numéro existe dans une liste,"col_name IN (2, 4, 6)"
4,PAS DEDANS (…),Le numéro n'existe pas dans une liste,"col_name NOT IN (1, 3, 5)"

En plus de rendre les résultats plus faciles à comprendre, l'écriture de clauses pour contraindre l'ensemble de lignes renvoyées permet également à la requête de s'exécuter plus rapidement en raison de la réduction des données inutiles renvoyées.

**Le saviez-vous?** Comme vous l'avez peut-être remarqué maintenant, SQL ne vous * oblige pas * à écrire les mots-clés en majuscules, mais par convention, il aide les gens à distinguer les mots-clés SQL des noms de colonnes et de tables, et facilite la lecture de la requête.

## Exercice

En utilisant les bonnes contraintes, recherchez les informations dont nous avons besoin dans le tableau **Movies** pour chaque tâche ci-dessous.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [29]:
x="""Id	Title	Director	Year	Length_minutes
1	Toy Story	John Lasseter	1995	81
2	A Bug's Life	John Lasseter	1998	95
3	Toy Story 2	John Lasseter	1999	93
4	Monsters, Inc.	Pete Docter	2001	92
5	Finding Nemo	Andrew Stanton	2003	107
6	The Incredibles	Brad Bird	2004	116
7	Cars	John Lasseter	2006	117
8	Ratatouille	Brad Bird	2007	115
9	WALL-E	Andrew Stanton	2008	104
10	Up	Pete Docter	2009	101
11	Toy Story 3	Lee Unkrich	2010	103
12	Cars 2	John Lasseter	2011	120
13	Brave	Brenda Chapman	2012	102
14	Monsters University	Dan Scanlon	2013	110"""
Movies = to_df(x)

In [30]:
Movies

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

1. Trouvez le film avec une rangée id de 6

In [33]:
QUERY1 = "SELECT * from Movies where Id = 6"

In [34]:
sqldf(QUERY1)

  Id            Title   Director  Year Length_minutes
0  6  The Incredibles  Brad Bird  2004            116

2. Retrouvez les films sortis entre 2000 et 2010

In [35]:
QUERY2 = "SELECT * from Movies where Year >= 2000 AND Year <= 2010"

In [36]:
sqldf(QUERY2)

   Id            Title        Director  Year Length_minutes
0   4   Monsters, Inc.     Pete Docter  2001             92
1   5     Finding Nemo  Andrew Stanton  2003            107
2   6  The Incredibles       Brad Bird  2004            116
3   7             Cars   John Lasseter  2006            117
4   8      Ratatouille       Brad Bird  2007            115
5   9           WALL-E  Andrew Stanton  2008            104
6  10               Up     Pete Docter  2009            101
7  11      Toy Story 3     Lee Unkrich  2010            103

3. Retrouvez les films  sortis hors période  2000 et 2010

In [43]:
QUERY3 = "SELECT * from Movies where Year < 2000 OR Year > 2010"

In [44]:
sqldf(QUERY3)

   Id                Title        Director  Year Length_minutes
0   1            Toy Story   John Lasseter  1995             81
1   2         A Bug's Life   John Lasseter  1998             95
2   3          Toy Story 2   John Lasseter  1999             93
3  12               Cars 2   John Lasseter  2011            120
4  13                Brave  Brenda Chapman  2012            102
5  14  Monsters University     Dan Scanlon  2013            110

4. Retrouvez les 5 premiers films Pixar et leur date de sortie

In [49]:
QUERY4 = "SELECT * from Movies order by Year LIMIT 5"

In [50]:
sqldf(QUERY4)

  Id           Title        Director  Year Length_minutes
0  1       Toy Story   John Lasseter  1995             81
1  2    A Bug's Life   John Lasseter  1998             95
2  3     Toy Story 2   John Lasseter  1999             93
3  4  Monsters, Inc.     Pete Docter  2001             92
4  5    Finding Nemo  Andrew Stanton  2003            107